{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "Admin",
    "1": "HR",
    "2": "IT",
    "3": "Finance",
    "4": "Marketing",
    "5": "Sales",
    "6": "Education"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Admin": 0,
    "Education": 6,
    "Finance": 3,
    "HR": 1,
    "IT": 2,
    "Marketing": 4,
    "Sales": 5
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.56.1",
  "vocab_size": 30522
}
